### 1. <i>Import Packages</i>

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import missingno as msno

In [2]:
import pyodbc

### 2. Guidlines to Dealing and Connect to SQL Server DB

<P>Using <b>Pyodbc</b> to connect to a <b>Microsoft sql server</b> database</P>

1- To install it <code>pip install pyodbc</code> <b>OR</b> <code>conda install pyodbc</code>

2- To Read <b>Documentation</b> visit: https://github.com/mkleehammer/pyodbc/wiki

In [3]:
import pyodbc

Find the <b>DRIVERS</b> available

In [4]:
pyodbc.drivers()

['SQL Server',
 'Microsoft Access Driver (*.mdb, *.accdb)',
 'Microsoft Excel Driver (*.xls, *.xlsx, *.xlsm, *.xlsb)',
 'Microsoft Access Text Driver (*.txt, *.csv)',
 'SQL Server Native Client 11.0',
 'SQL Server Native Client RDA 11.0',
 'ODBC Driver 17 for SQL Server',
 'ODBC Driver 18 for SQL Server']

Create a VARIABLE to store the <b>connection string</b>

In [5]:
conn = 'DRIVER={ODBC Driver 17 for SQL Server};SERVER=DESKTOP-2BVV9CV;DATABASE=ContosoRetailDW;Trusted_Connection=yes;'

Write random <b>Query</b> to select first 10 row from DimProduct table

In [6]:
query = 'select top(10) * from DimProduct'

<b>Create</b> a CONNECTION and <b>import</b> the DATA

In [7]:
## connect and execute and fetch_data
with pyodbc.connect(conn) as conx:  ##open connection and it will close automaticly after exiting with
    cursor = conx.cursor()          ## create a cursor we will use to communicate with database
    cursor.execute(query)           ## Run the query we had written before
    data = cursor.fetchall()        ## Extract all the data

<b>Display</b> first row of data

In [8]:
print(data[:1])

[(1, '0101001', 'Contoso 512MB MP3 Player E51 Silver', '512MB USB driver plays MP3 and WMA', 1, 'Contoso, Ltd', 'Contoso', '1', 'Economy', '1', 'Product0101001', '7', 'Silver', '2.2 x 1.8 x 4 ', ' ', ' ', 4.8, 'ounces', '1', 'inches', '1', 'High', Decimal('6.6200'), Decimal('12.9900'), datetime.datetime(2005, 5, 3, 0, 0), None, 'On', None, None, 1, datetime.datetime(2008, 5, 25, 8, 1, 12), datetime.datetime(2008, 5, 25, 8, 1, 12))]

Extract <b>Column Names</b>

In [9]:
product_columns = [row.column_name for row in cursor.columns(table='DimProduct')]

Convert Query results to <b>DataFrame</b>

<b>WITH PANDAS EVERYTHING IS EASY<b>

EXTRACT data using <b>read_sql</b> in format <b>DataFrame</b>

In [12]:
with pyodbc.connect(conn) as conx:  ##open connection and it will close automaticly after exiting with
    result = pd.read_sql('select BrandName from DimProduct',conx)

result[:1]

  BrandName
0   Contoso

Declare Function for usability purpose

In [13]:
def run_query(query):
    with pyodbc.connect(conn) as conx: 
        result = pd.read_sql(query,conx)
    return result

<b>Final Statement To extract Data from the DB in the Future</b>

<code>data = run_query('Write the Query Here....')</code>

### 3. Customer Analysis and Classification

#### 1.<b>import</b> data.

In [23]:
customer_view = run_query('select * from V_Customer ')

In [25]:
customer_view.head()

,CustomerKey,Age,MaritalStatus,Gender,YearlyIncome,TotalChildren,NumberChildrenAtHome,Education,HouseOwnerFlag,NumberCarsOwned,Consumption
0,4784,55,M,M,90000.0,3,3,Bachelors,1,0,33837.2515
1,4785,55,M,F,90000.0,4,4,Bachelors,1,0,31385.0605
2,4786,60,S,M,70000.0,1,0,Partial College,1,1,30868.0360
3,4787,60,M,M,70000.0,1,0,Partial College,1,1,32560.8110
4,4788,61,S,F,60000.0,1,0,Partial College,1,1,32655.6465

#### 2. Exploratory Data Analysis <b>EDA</b>

In [29]:
customer_view.shape

(18484, 11)

In [31]:
customer_view.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18484 entries, 0 to 18483
Data columns (total 11 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   CustomerKey           18484 non-null  int64
 1   Age                   18484 non-null  int64
 2   MaritalStatus         18484 non-null  object
 3   Gender                18484 non-null  object
 4   YearlyIncome          18484 non-null  float64
 5   TotalChildren         18484 non-null  int64
 6   NumberChildrenAtHome  18484 non-null  int64
 7   Education             18484 non-null  object
 8   HouseOwnerFlag        18484 non-null  object
 9   NumberCarsOwned       18484 non-null  int64
 10  Consumption           18484 non-null  float64
dtypes: float64(2), int64(5), object(4)
memory usage: 1.6+ MB

In [35]:
customer_view['HouseOwnerFlag'].unique()

array(['1', '0'], dtype=object)

In [39]:
customer_view['Education'].unique()

array(['Bachelors', 'Partial College', 'High School', 'Graduate Degree',
       'Partial High School'], dtype=object)

In [41]:
customer_view.nunique()

CustomerKey             18484
Age                        70
MaritalStatus               2
Gender                      2
YearlyIncome               16
TotalChildren               6
NumberChildrenAtHome        6
Education                   5
HouseOwnerFlag              2
NumberCarsOwned             5
Consumption             18477
dtype: int64

In [45]:
customer_view['YearlyIncome'].unique()

array([ 90000.,  70000.,  60000.,  40000.,  30000., 110000., 120000.,
       130000., 100000.,  80000., 170000.,  10000.,  20000.,  50000.,
       160000., 150000.])

In [49]:
customer_view.describe()

,CustomerKey,Age,YearlyIncome,TotalChildren,NumberChildrenAtHome,NumberCarsOwned,Consumption
count,18484.000000,18484.000000,18484.000000,18484.000000,18484.000000,18484.000000,18484.000000
mean,9242.500000,60.420039,57305.777970,1.844352,1.004058,1.502705,37099.852957
std,5336.015523,11.249188,32285.841703,1.612408,1.522660,1.138394,12827.674330
min,1.000000,42.000000,10000.000000,0.000000,0.000000,0.000000,14082.861900
25%,4621.750000,52.000000,30000.000000,0.000000,0.000000,1.000000,29513.601875
50%,9242.500000,59.000000,60000.000000,2.000000,0.000000,2.000000,33292.109750
75%,13863.250000,68.000000,70000.000000,3.000000,2.000000,2.000000,38475.990375
max,18484.000000,112.000000,170000.000000,5.000000,5.000000,4.000000,85363.952500